<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL DateTime functions 
Â© ExploreAI Academy

In this exercise, we will use DateTime functions to aggregate and filter date and time data in order to extract relevant information.

## Learning objectives

By the end of this train, you should be able to:
- Measure the period between dates and times.
- Extract portions of a DateTime column.
- Filter a DateTime column using logical and comparison operators.

First, let's load our sample database:

In [21]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [32]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///db/chinook.db

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

[Image source](https://www.sqlitetutorial.net/sqlite-sample-database/)

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Run a query that will give us a view of the data type of the employees table.

In [38]:
%%sql

PRAGMA table_info(employees);

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[(0, 'EmployeeId', 'INTEGER', 1, None, 1),
 (1, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (2, 'FirstName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Title', 'NVARCHAR(30)', 0, None, 0),
 (4, 'ReportsTo', 'INTEGER', 0, None, 0),
 (5, 'BirthDate', 'DATETIME', 0, None, 0),
 (6, 'HireDate', 'DATETIME', 0, None, 0),
 (7, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (8, 'City', 'NVARCHAR(40)', 0, None, 0),
 (9, 'State', 'NVARCHAR(40)', 0, None, 0),
 (10, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (11, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (12, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (13, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (14, 'Email', 'NVARCHAR(60)', 0, None, 0)]

In [37]:
%%sql
--To show tables in a sqlite database
SELECT name FROM sqlite_schema WHERE type = 'table' ORDER BY name;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoice_items',),
 ('invoices',),
 ('media_types',),
 ('playlist_track',),
 ('playlists',),
 ('sqlite_sequence',),
 ('sqlite_stat1',),
 ('tracks',)]

### Exercise 2


We write a query that shows the age of all employees when they were hired.

Return data in the `FirstName` and `LastName` columns and create an `Age when hired` alias for the age from the employees table.

In [48]:
%%sql

SELECT 
    FirstName, 
    LastName, 
    HireDate - BirthDate AS "Age when hired"
FROM 
    employees
ORDER BY "Age when hired";

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('Jane', 'Peacock', 29),
 ('Michael', 'Mitchell', 30),
 ('Robert', 'King', 34),
 ('Laura', 'Callahan', 36),
 ('Steve', 'Johnson', 38),
 ('Andrew', 'Adams', 40),
 ('Nancy', 'Edwards', 44),
 ('Margaret', 'Park', 56)]

### Exercise 3

In the context of DateTime SQL objects, the `substr()` function allows us to trim or extract certain information within the date or time. We use it by specifying the string and the indices from which to show data, i.e.
`substr(datetime_column,start_index, end_index)`

Write a query that calculates the month-to-month revenue at Chinook. 

Return the month and revenue and use aliases to name the calculated columns appropriately.

In [53]:
%%sql
SELECT 
    substr(InvoiceDate,1,7) as Month,
    SUM(Total) as MonthTotal
FROM 
    invoices
GROUP BY
    Month
ORDER BY 
    Month
LIMIT 10;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('2009-01', 35.64),
 ('2009-02', 37.62),
 ('2009-03', 37.62),
 ('2009-04', 37.62),
 ('2009-05', 37.62),
 ('2009-06', 37.62),
 ('2009-07', 37.62),
 ('2009-08', 37.62),
 ('2009-09', 37.62),
 ('2009-10', 37.62)]

### Exercise 4

Write a query that calculates the year-to-year revenue at Chinook.

In [60]:
%%sql
SELECT 
    substr(InvoiceDate,1,4) as Year,
    SUM(Total) as YearTotal
FROM 
    invoices
GROUP BY
    1 -- refers to Year
ORDER BY 
    2 DESC -- refers to YearTotal
LIMIT 10;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('2010', 481.45),
 ('2012', 477.53),
 ('2011', 469.58),
 ('2013', 450.58),
 ('2009', 449.46)]

### Exercise 5

Write a query that returns employees who were hired after 2002-08-14 and before 2003-10-17.

In [61]:
%%sql 

SELECT 
    *
FROM 
    employees
WHERE 
    HireDate between '2002-08-14' AND '2003-10-17';

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com')]

## Solutions

### Exercise 1

In [8]:
%%sql

PRAGMA table_info(employees);

 * sqlite:///chinook.db
Done.

[]

### Exercise 2

In [54]:
%%sql

SELECT 
    FirstName, 
    LastName, 
    HireDate - BirthDate AS "Age when hired"
FROM 
    employees
ORDER BY 3;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('Jane', 'Peacock', 29),
 ('Michael', 'Mitchell', 30),
 ('Robert', 'King', 34),
 ('Laura', 'Callahan', 36),
 ('Steve', 'Johnson', 38),
 ('Andrew', 'Adams', 40),
 ('Nancy', 'Edwards', 44),
 ('Margaret', 'Park', 56)]

The "Age when hired" column contains INTERVAL type data, i.e. in years in this case. In other words, we subtracted two dates to obtain an interval value.

### Exercise 3

In [55]:
%%sql

SELECT 
    SUBSTR(InvoiceDate,1,7) AS "Month", 
    SUM(Total) AS "Revenue"
FROM 
    invoices
GROUP BY 1
ORDER BY 1
LIMIT 10;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('2009-01', 35.64),
 ('2009-02', 37.62),
 ('2009-03', 37.62),
 ('2009-04', 37.62),
 ('2009-05', 37.62),
 ('2009-06', 37.62),
 ('2009-07', 37.62),
 ('2009-08', 37.62),
 ('2009-09', 37.62),
 ('2009-10', 37.62)]

### Exercise 4

In [57]:
%%sql

SELECT 
    SUBSTR(InvoiceDate,1,4) AS "Year", 
    ROUND(SUM(Total),2) AS "Revenue"
FROM invoices
GROUP BY 1
ORDER BY 1;

   sqlite:///chinook.db
 * sqlite:///db/chinook.db
Done.

[('2009', 449.46),
 ('2010', 481.45),
 ('2011', 469.58),
 ('2012', 477.53),
 ('2013', 450.58)]

### Exercise 5

In [ ]:
%%sql 

SELECT 
    *
FROM 
    employees
WHERE 
    HireDate between '2002-08-14' AND '2003-10-17';

We can achieve the same result using standard comparison operators such as <, >, and =.

In [ ]:
%%sql 

SELECT 
      *
FROM 
      employees
WHERE 
      HireDate > '2002-08-14' AND
      HireDate < '2003-10-17';

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>